Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.Status
The request execution status for the service.
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.Perpendicular
Perpendicular to the instanteneous tangent at point on geometry to pass
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.Tangent
Instanteneous tangent at point on geometry to pass
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.PointOnGeometry
Point on geometry to pass
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.Point
Point to pass
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.Station
Station value to pass
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.Distance
Distance value to pass
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.Document
Document containing alignment
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.DefaultLabelSetTypeId
Default type for label set creation
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.ElementId
Element associated with the Alignment
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.Request
The request type for the service.
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData.#ctor
Initializes to a default, unusable state; Revit needs to make it usable
before passing it to the IInfrastructureAlignmentServer instance.
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceData
This is a data container used to collect information from an IAlignmentServer
for a given Alignment
Since:
2021